// Задача 62. Напишите программу, которая заполнит спирально массив 4 на 4.
// Например, на выходе получается вот такой массив:
// 01 02 03 04
// 12 13 14 05
// 11 16 15 06
// 10 09 08 07
// int[,] CreateMatrixRndInt(int rows, int columns)

    // mat[0, 0] = min;
    // mat[0, 1] = min + 1;
    // mat[0, 2] = min + 2;
    // mat[0, 3] = min + 3;

    // mat[1, 3] = min + 4;
    // mat[2, 3] = min + 5;
    // mat[3, 3] = min + 6;

    // mat[3, 2] = min + 7;
    // mat[3, 1] = min + 8;
    // mat[3, 0] = min + 9;

    // mat[2, 0] = min + 10;
    // mat[1, 0] = min + 11;

    // mat[1, 1] = min + 12;
    // mat[1, 2] = min + 13;

    // mat[2, 2] = min + 14;
    // mat[2, 1] = min + 15;
    // return mat;
